Revit 2024 API
AnalyticalNodeData.GetConnectionStatus Method
 Returns the Connection Status for this Analytical Node.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public AnalyticalNodeConnectionStatus GetConnectionStatus()
Visual Basic
Public Function GetConnectionStatus As AnalyticalNodeConnectionStatus
Visual C++
public:
AnalyticalNodeConnectionStatus GetConnectionStatus()
See Also
AnalyticalNodeData Class
Autodesk.Revit.DB.Structure Namespace